import React from 'react';
import Container from 'shared/ui/container/Container';
import './Policy.scss';
import { Link } from 'react-router-dom';

const Policy = () => {
	return (
		<section className="policy">
			<Container>
				<div className="inner-wrapper">
					<h2 className="title">ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ</h2>
					<ul className="list">
						<li className="item">
							<h3 className="subtitle">1. загальні положення</h3>
							<p className="text">
								{' '}
								<strong>1.1</strong> Цей документ є публічною
								Офертою "ВIТЕР А.О. ФОП" (надалі іменованого
								Виконавець) і містить усі істотні умови надання
								послуг будь-якій юридичній або фізичній особі,
								що іменується в подальшому «Замовник».
							</p>
							<p className="text">
								{' '}
								<strong>1.2</strong> У разі прийняття наведених
								нижче умов та оплати послуг фізична особа, яка
								проводить акцепт цієї Оферти, стає Замовником.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>1.3</strong> Ці Умови розміщені у
								вільному доступі на веб-сайті.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>1.4</strong> Положення, які містяться у
								цій Оферті, можуть бути змінені в
								односторонньому порядку Виконавцем. Інформація
								про зміни цих Умов розміщується на сайті
								viter-hairstore.com за 3 календарні дні до
								введення змін.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>1.5</strong> Цей документ визначає
								суттєві умови публічного договору щодо купівлі
								та використання послуг Виконавця.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>1.6</strong> Незнання цих Умов не є
								підставою для пред'явлення з боку Замовника
								будь-яких претензій до Виконавця.
							</p>
							<p className="text">
								{' '}
								<strong>1.7</strong> Замовник підтверджує свою
								згоду з умовами, встановленими цією Угодою,
								шляхом проставлення позначки у графі «Я
								прочитав(-ла) Умови угоди та згоден(-на) з
								умовами» при оформленні замовлення.
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">2. ПРЕДМЕТ ДОГОВОРУ</h3>
							<p className="text">
								{' '}
								<strong>2.1</strong> Предметом цієї Оферти є
								надання комунально-побутових послуг (далі –
								послуги).
							</p>
							<p className="text">
								{' '}
								<strong>2.2</strong> Виконавець надає послуги
								відповідно до чинного прейскуранта,
								опублікованого на інтернет-сайті виконавця
								viter-hairstore.com, у розділі : а Замовник
								здійснює оплату послуги відповідно до умов цього
								Договору.
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">
								3 ОФОРМЛЕННЯ ЗАМОВЛЕННЯ{' '}
							</h3>
							<p className="text">
								<strong>3.1</strong> Замовлення послуг
								здійснюється Замовником за допомогою банківської
								картки через інтернет-сайт viter-hairstore.com
							</p>
							<p className="text">
								{' '}
								<strong>3.2</strong> Під час замовлення послуг
								Виконавцем Замовник зобов'язується надати
								наступну реєстраційну інформацію про себе:
								<ul>
									<li className="text">
										прізвище, ім'я (украйнською);
									</li>
									<li className="text">
										адреса електронної пошти;
									</li>
									<li className="text">
										контактний телефон.
									</li>
								</ul>
							</p>
							<p className="text">
								{' '}
								<strong>3.3</strong>
								Прийняття Замовником умов цього Договору
								здійснюється за допомогою внесення Замовником
								відповідних даних до реєстраційної форми при
								оформленні замовлення. Виконавець не змінює та
								не редагує реєстраційну інформацію про Замовника
								без згоди останнього. Виконавець зобов'язується
								не повідомляти дані Замовника, зазначені під час
								реєстрації на сайті viter-hairstore.com та при
								оформленні замовлення, особам, які не мають
								відношення до виконання замовлення. Після
								оформлення замовлення Замовник отримує
								унікальний ідентифікаційний номер замовлення
								послуг.
							</p>
							<p className="text">
								{' '}
								<strong>3.4</strong> Виконавець не несе
								відповідальності за зміст та достовірність
								інформації, наданої Замовником при оформленні
								замовлення.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>3.5</strong> Замовник несе
								відповідальність за достовірність наданої
								інформації при оформленні замовлення.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>3.6</strong> Виконавець не перевіряє
								надану Замовником інформацію та не несе
								відповідальності перед будь-якими третіми
								особами за точність та достовірність такої
								інформації, не розцінює надану Замовником
								інформацію як персональні дані, що підлягають
								спеціальному захисту. При цьому Замовник
								погоджується на обробку та передачу будь-яким
								третім особам реєстраційних даних у разі, якщо
								це необхідно для надання Замовнику Подарункового
								сертифікату, а також для інформування його (за
								бажанням) про послуги, що надаються Виконавцем.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>3.7</strong> Оплата Замовником
								самостійно оформленого на інтернет-сайті
								замовлення послуг означає згоду Замовника з
								умовами цього Договору.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>3.8</strong> Всі інформаційні матеріали,
								представлені на сайті viter-hairstore.com, мають
								довідковий характер. Всю інформацію про послуги
								можна уточнити за телефоном Виконавця: +38 073
								001 11 10{' '}
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">4 ОПЛАТА ПОСЛУГ</h3>
							<p className="text">
								<strong>4.1</strong> Оплата за цим договором
								проводиться у украйнській гривні.
							</p>
							<p className="text">
								{' '}
								<strong>4.2</strong> Вартість замовлення на
								сайті може бути змінена Виконавцем в
								односторонньому порядку до моменту оплати. При
								цьому вартість на оплачені Замовлення не
								підлягає зміні.
							</p>

							<p className="text">
								{' '}
								<strong>4.3</strong> Способи оплати:
								<p className="subtext">
									<strong>Готівковий розрахунок</strong>
									<span className="text">
										Якщо процедура здійснюється в салні, то
										оплата здійснюється готівкою.
									</span>
								</p>
								<p className="subtext">
									<strong>Банківською карткою</strong>
									<span className="text">
										Для вибору оплати товару за допомогою
										банківської картки на відповідній
										сторінці необхідно натиснути кнопку
										«Оплата замовлення банківською карткою».{' '}
									</span>
								</p>
							</p>
							<p className="text">
								{' '}
								<strong>4.4</strong> Оплата з використанням
								реквізитів банківських карток на Інтернет-сайті
								здійснюється в системі{' '}
								<strong>DIKIDI Business</strong> та електронних
								платежів застосунку{' '}
								<strong>
									<a href="https://www.liqpay.ua">LiqPay</a>
								</strong>
								, який пройшов сертифікацію у платіжних системах
								Visa Int., MasterCard Europe Sprl, JCB. на
								здійснення операцій з автентифікацією 3-D
								Secure. Представлені дані повністю захищені в
								рамках стандарту безпеки даних індустрії
								платіжних карток (Payment Card Industry Data
								Security Standard) і ніхто, включно з
								Виконавцем, не може їх отримати.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>4.5</strong> Послуга вважається
								оплаченою з моменту успішного завершення
								операції по картці. Факт оплати послуги
								підтверджується Виконавцем шляхом надсилання
								листа із сертифікатом Замовнику на електронну
								адресу, вказану Замовником.
							</p>
							<p className="text">
								{' '}
								<strong>4.5</strong> У разі неотримання
								Замовником листа на електронну адресу, Замовник
								повинен зв'язатися з Виконавцем для отримання
								підтвердження про оплату послуги протягом 2
								(двох) робочих днів з моменту оплати.{' '}
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">
								5 ПРАВА ТА ОБОВ'ЯЗКИ ВИКОНАВЦЯ
							</h3>
							<p className="text">
								{' '}
								<strong>5.1</strong> Виконавець зобов'язується
								надати послуги відповідно до п. 2.1 цього
								Договору.
							</p>
							<p className="text">
								{' '}
								<strong>5.2</strong> Погодити час та перелік
								Послуг, замовлених Замовником.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>5.3</strong> Використовуючи Засоби
								зв'язку інформувати Замовника про Послуги та
								умови їх отримання.{' '}
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">
								6 ПРАВА ТА ОБОВ'ЯЗКИ ЗАМОВНИКА
							</h3>
							<p className="text">
								{' '}
								<strong>6.1</strong> Замовник зобов'язується
								своєчасно оплачувати вибрані Послуги Виконавця
								відповідно до встановлених на момент оплати цін.
							</p>
							<p className="text">
								{' '}
								<strong>6.2</strong> Замовник зобов'язується
								самостійно та своєчасно ознайомитись на сайті
								Виконавця із встановленими цінами, видами
								Послуг, порядком та строками їх надання,
								правилами безпеки.
							</p>
							<p className="text">
								{' '}
								<strong>6.3</strong> Замовник зобов'язується
								надіслати необхідну інформацію для надання
								Послуг Замовником за допомогою засобів зв'язку.{' '}
							</p>
							<p className="text">
								Замовник зобов'язується дотримуватись правил
								відвідування спа салону, які є невід'ємною
								частиною даного договору та викладені у п.п.7.
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">
								7. УМОВИ РОЗІРВАННЯ ДОГОВОРУ{' '}
							</h3>
							<p className="text">
								{' '}
								7 <strong>.</strong>1 Цей договір, можливо,
								розірвано з ініціативи Замовника до початку
								надання послуг шляхом подання письмової заяви
								Виконавцю. <br />
								<br />У разі відмови від оплачених по картці
								послуг у строк за 1 (один) день до початку
								надання послуг, повернення коштів провадиться у
								повному обсязі. У разі якщо послуга не була
								скасована у належні терміни, повернення коштів
								здійснюється за вирахуванням понесених
								Виконавцем витрат через пізню відмову від послуг
								Замовником.
							</p>
							<p className="text">
								{' '}
								<strong>7.2</strong> Кошти у разі коректно
								оформленої процедури відмови/скасування
								повертаються на картку, з якої проводилася
								оплата. Повернення іншими способами не
								провадиться.{' '}
							</p>
							<p className="text">
								{' '}
								<strong>7.3</strong> Виконавець має право
								змінити дату та час надання послуги, повідомивши
								про це Замовника послуг не менше ніж за 12 годин
								до початку надання послуг, отримавши
								підтвердження про згоду Замовника зі змінами.
								Замовник має право відмовитися від внесення змін
								до даних замовленої послуги, на підставі чого
								послуги вважатимуться скасованими з подальшим
								поверненням коштів на картку, з якою
								здійснювалась оплата.
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">8. ЗАКЛЮЧНІ ПОЛОЖЕННЯ </h3>
							<p className="text">
								<strong>8.1</strong> Всі претензії щодо
								неналежного надання послуг Замовник має право
								повідомити операторів Виконавця за вказаним у
								пункті 10 телефоном. Вся інформація, що надійшла
								обробляється в найкоротші терміни.
							</p>
							<p className="text">
								{' '}
								<strong>8.2</strong> При зборі та обробці
								персональних даних Замовника Виконавець
								керується{' '}
								<strong>
									{' '}
									<Link to="/rules">
										Політика конфіденційності{' '}
									</Link>
								</strong>
							</p>
							<p className="text">
								{' '}
								<strong>8.3</strong> Передає персональні дані
								сторона дає згоду на обробку персональних даних
								будь-якими способами, включаючи збирання,
								систематизацію, накопичення, зберігання,
								оновлення, зміну, використання, знеособлення,
								блокування, знищення. Замовник розуміє та
								погоджується з тим, що будь-яка інформація, яка
								стала відома Виконавцю про Замовника у зв'язку з
								виконанням зобов'язань у рамках цього Договору,
								може бути використана Виконавцем у маркетингових
								цілях, у тому числі для проведення рекламних
								заходів, розсилки повідомлень, рекламної
								інформації. Згода суб'єкта персональних даних
								діє до моменту отримання Виконавцем письмового
								повідомлення про відкликання цієї згоди.
								Замовник повинен мати письмове підтвердження
								одержання відмови Виконавцем.
							</p>
							<p className="text">
								{' '}
								<strong>8.4</strong> питань оплати, якості,
								своєчасності отримання послуг, інших питань щодо
								операції по картці Клієнт може звернутися за
								телефоном +38 073 001 11 10. <br />
								За невиконання або неналежне виконання своїх
								обов'язків за цим Договором Сторони несуть
								відповідальність, передбачену чинним
								законодавством України <br />
								Виконавець за жодних обставин не несе
								відповідальності перед Замовником за непрямі
								збитки. Поняття «непрямі збитки» включає, але з
								обмежується: втрату доходу, прибутку, очікуваної
								економії, ділову активність. Сукупна
								відповідальність Виконавця за цим Договором
								обмежується відшкодуванням Замовнику прямої
								доведеної шкоди у розмірі, що не перевищує суми,
								фактично сплаченої Замовником. <br />
								Сторони звільняються від відповідальності за
								часткове або повне невиконання зобов'язань за
								Договором, якщо таке стало наслідком дії
								непереборної сили, що виникли після укладення
								Договору. Під обставинами непереборної сили
								розуміються надзвичайні обставини, які
								перебувають поза контролем Сторін, які Сторона,
								яка зазнала їх впливу, не могла не передбачати,
								ані запобігти розумним заходам. Такими
								визнаються пожежа, повінь, землетрус, ураган,
								епідемія, страйк, воєнні дії, заборонні акти
								державних органів, технічні перешкоди при
								здійсненні зв'язку в Інтернеті та інші подібні
								обставини. Сторона, яка посилається на такі
								обставини, зобов'язана у семиденний строк з дня
								їх настання у письмовій формі повідомити іншу
								Сторону про це, а також подати докази у розумно
								короткий термін. <br />
								З усіх питань, які не врегульовані в тексті
								цього Договору, сторони керуються чинним
								законодавством України. <br />
								У разі виникнення розбіжностей чи суперечок з
								питань, що виникли або пов'язані з виконанням
								цього Договору, Сторони вживатимуть усіх
								можливих заходів для вирішення їх шляхом
								переговорів. У разі досягнення згоди, суперечки
								вирішуються у порядку, встановленому чинним
								законодавством України. <br />
								Договір набирає чинності з моменту внесення
								оплати Замовником цього Договору і укладається
								на невизначений термін, але не більше строку дії{' '}
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">9. РЕКВІЗИТИ </h3>
							<p className="text">"ВIТЕР А.О. ФОП"</p>
							<p className="text">
								{' '}
								<strong>ЄДРПОУ</strong> 3305414266
							</p>
							<p className="text">
								{' '}
								<strong>IBAN</strong>{' '}
								UA623052990000026000050588274{' '}
							</p>
							<p className="text">
								{' '}
								<strong>Адреса: </strong> м. Дніпро, вул.
								Троїцька, 13
							</p>
							<p className="text">
								{' '}
								<strong>тел.</strong> +3 80 (93) 510 10 04{' '}
							</p>
						</li>
					</ul>
				</div>
			</Container>
		</section>
	);
};

export default Policy;
