import React from 'react';
import Container from 'shared/ui/container/Container';
import './Rules.scss';

const Rules = () => {
	return (
		<section className="rules">
			<Container>
				<div className="inner-wrapper">
					<h2 className="title">Правила використання сайту</h2>
					<ul className="list">
						<li className="item">
							<h3 className="subtitle">Основне положення</h3>
							<p className="text">
								Власником та оператором сайту
								www.viter-hairstore.com є Вітер Антоніна,
								юридична адреса: вул. Троїцька 13, м. Дніпро
								Украйна.
								<span className="text">
									Оператору належать всі авторські права на
									весь контент, який Оператор розміщує на
									сайті www.viter-hairstore.com, включаючи
									текст, дизайн сайту, технічні ескізи,
									графіку, всі зображення на цьому сайті, а
									також добірку та розташування файлів, що
									містяться на цьому сайті.
								</span>
								<span className="text">
									Права та обов'язки Оператора та Користувачів
									при використанні даного сайту регулюються
									цими Правилами використання сайту (далі –
									«Правила»), дія яких поширюється на всіх
									осіб, які відвідують цей сайт (далі -
									"Користувачі"). Користувач висловлює свою
									згоду з цим, як правило, шляхом доступу до
									будь-якого сайту Оператора або будь-яким
									способом з використанням будь-якої
									інформації, розміщеної на сайті Оператора.
								</span>
								Публікація будь-яких даних чи інформації на
								сайті www.viter-hairstore.com, за винятком цього
								документа, не носить характеру будь-якого
								правового акта, якщо інше прямо не зазначено у
								окремих випадках.
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">
								ЗБІР ТА ВИКОРИСТАННЯ ІНФОРМАЦІЇ
							</h3>
							<p className="text">
								З метою покращення Вашого досвіду під час
								відвідування Сайту власник та оператор цього
								сайту (надалі – «Ми», «Viter Hair Studio») може
								просити Вас надати нам певну персональну
								інформацію, включаючи, але не обмежуючись: Ваше
								ім’я, номер телефону, адресу електронної пошти
								тощо. Інформація, яку ми збираємо, буде
								використана для зв’язку, Вашої ідентифікації
								та/або надання Вам відповідних послуг.
							</p>
							<h5 className="subtext">
								Яку інформацію ми збираємо:
							</h5>
							<p className="text">
								Ми можемо запитувати Ваші персональні дані з
								метою надання Вам послуг.
							</p>
							<p className="text">
								Viter Hair Studio може збирати певні персональні
								дані (далі – «Персональні дані»), які
								добровільно надаються відвідувачами Сайту під
								час сеансу (із) використання Сайту.
							</p>
							<p className="subtext">
								Ці Персональні дані включають:
							</p>
							<ul>
								<li>
									<p className="text">
										контактну інформацію, включаючи ім’я,
										адресу електронної пошти, телефонний
										номер, адресу проживання;
									</p>
								</li>
								<li>
									<p className="text">
										логін та дані облікового запису,
										включаючи нікнейм, пароль та унікальний
										ідентифікатор користувача;
									</p>
								</li>
								<li>
									<p className="text">
										особисті дані, включаючи стать, дату
										народження;
									</p>
								</li>
								<li>
									<p className="text">
										інформацію, необхідну для здійснення
										платежів.
									</p>
								</li>
							</ul>

							<p className="subtext">
								Під час взаємодії з Сайтом певні дані
								автоматично збираються з Вашого пристрою або
								веб-браузера, як описано нижче в розділі під
								назвою «Файли cookie та піксельні теги». Ці дані
								включають:
							</p>
							<ul>
								<li>
									<p className="text">
										ідентифікатори пристроїв, стан
										з’єднання, доступ до мережі, інформація
										про зберігання;{' '}
									</p>
								</li>
								<li>
									<p className="text">
										файли cookie, IP-адреси, заголовки
										посилань, дані, що ідентифікують Ваш
										веб-браузер і версію, веб-маяки, теги
										тощо.
									</p>
								</li>
								<li>
									<p className="text">
										логін та дані облікового запису,
										включаючи нікнейм, пароль та унікальний
										ідентифікатор користувача;
									</p>
								</li>
								<li>
									<p className="text">
										особисті дані, включаючи стать, дату
										народження;
									</p>
								</li>
								<li>
									<p className="text">
										інформацію, необхідну для здійснення
										платежів.
									</p>
								</li>
							</ul>
						</li>
						<li className="item">
							<h3 className="subtitle">Комунікація</h3>
							<p className="text">
								Надаючи свою контактну інформацію, Ви
								погоджуєтесь отримувати від нас певні електронні
								повідомлення. Ви погоджуєтеся з тим, що будь-яке
								повідомлення, угода чи будь-які інші сповіщення,
								які ми надсилаємо Вам в електронному вигляді,
								відповідатимуть усім і будь-яким юридичним
								вимогам щодо повідомлення та/або сповіщення,
								включно з вимогою про письмову форму таких
								сповіщень/повідомлень. Усі дзвінки, електронні
								листи та інші повідомлення між Вами та Viter
								Hair Studio можуть записуватися.
								<span className="text">
									Надаючи нам свою електронну адресу, номер
									телефону та інші особисті дані або
									підписуючись через форму підписки на Сайті,
									Ви даєте згоду на те, що ми можемо надсилати
									Вам маркетингові пропозиції, рекламні та
									інші повідомлення і сповіщення щодо наших
									послуг.
								</span>
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">COOKIES and Pixel Tags</h3>
							<p className="text">
								«Cookies» — это информация, которая передается с
								сайта на жесткий диск компьютера Пользователя.
								Файлы cookie позволяют веб-сайту запоминать
								важную информацию, которая облегчит Пользователю
								дальнейшее его использование. Как и большинство
								веб-сайтов, веб-сайт Оператора также использует
								файлы cookie. На основе анонимных объектов
								данных, например, Оператор отслеживает общее
								количество посетителей этих страниц.
								<span className="text">
									Если Пользователь не хочет использовать
									файлы cookie или если он хочет, чтобы
									интернет-браузер уведомлял об использовании
									файлов cookie, он должен выбрать
									соответствующую опцию в своем
									интернет-браузере. Если Пользователь
									заблокирует все файлы cookie, он не сможет
									использовать некоторые функции этого
									веб-сайта.
								</span>
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">
								Політикa конфіденційності
							</h3>
							<p className="text">
								Використовуючи Сайт, Ви погоджуєтеся на збір і
								використання Вашої Персональної інформації
								компанією Viter Hair Studio. Слід також
								зазначити, що чинне законодавство та наша
								практика можуть змінюватись час від часу. Якщо
								ми вирішимо оновити нашу Політику
								конфіденційності, ми опублікуємо зміни на Сайті.
								Якщо ми суттєво змінимо спосіб обробки Ваших
								Персональних даних, ми надамо Вам попереднє
								сповіщення або, якщо це вимагається
								законодавством, запитаємо Вашу згоду перед
								впровадженням таких змін. Ми рекомендуємо Вам
								ознайомитися з нашою Політикою конфіденційності
								та бути в курсі нашої практики та подальших
								змін.{' '}
							</p>
						</li>
						<li className="item">
							<h3 className="subtitle">
								Питання, скарги та відгуки
							</h3>
							<p className="text">
								Ми вітаємо запитання, коментарі та скарги щодо
								нашої Політики конфіденційності. Якщо Ви бажаєте
								надіслати відгук або у Вас є запитання чи
								скарги, або бажаєте скористатися своїми правами,
								пов’язаними з Вашими Персональними даними,
								надішліть нам електронний лист на
								viter-hair.studio@gmail.com . Ви також можете
								зв’язатися з нами за адресою: 49000, м. Дніпро,
								вул. Троїцька, буд. 13, ідентифікаційний код
								юридичної особи 3305414266.{' '}
							</p>
						</li>
					</ul>
				</div>
			</Container>
		</section>
	);
};

export default Rules;
